IDENTIFICATION DIVISION.
PROGRAM-ID. MULT2.

DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 NUM1 PIC 9(10).
	01 NUM2 PIC 9(10).
	01 RESULT PIC 9(11).

PROCEDURE DIVISION.  

	ACCEPT NUM1.
	ACCEPT NUM2.
	MULTIPLY NUM1 BY NUM2 GIVING RESULT.
	DISPLAY "RESULT IS ", RESULT.

STOP RUN.

